{"cells":[{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["import requests"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["data = requests.get(\"https://raw.githubusercontent.com/SkillfactoryDS/Datasets/master/war_peace_processed.txt\").text\n"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["data = data.split('\\n')\n","data.remove('')\n","data = data + ['[new chapter]']\n","print(data[:100])"]},{"cell_type":"markdown","metadata":{},"source":["# Работаем с данными\n","Общее количество слов и количество уникальных слов в тексте"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["# Превращаем список в множество, удаляя дублирующиеся слова\n","word_set = set(data)\n","# Удаляем из множества слово, символизирующее раздел между главами\n","word_set.discard('[new chapter]')\n","# Выводим результаты\n","print('Общее количество слов: {}'.format(len(data)))\n","print('Общее количество уникальных слов: {}'.format(len(word_set)))"]},{"cell_type":"markdown","metadata":{},"source":["Частота каждого слова и количество глав"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["# Инициализируем пустой словарь\n","word_counts = {}\n","# Инициализируем количество глав\n","count_chapter = 0\n","# Создаем цикл по всем словам из списка слов\n","for word in data:\n","    # Проверяем, что текущее слово - обозначение новой главы\n","    if word == '[new chapter]':\n","        # Если условие выполняется, то увеличиваем количество глав на 1\n","        count_chapter += 1\n","        # Переходим на новую итерацию цикла\n","        continue\n","    # Проверяем, что текущего слова еще нет в словаре слов\n","    if word not in word_counts:\n","        # Если условие выполняется, инициализируем новый ключ 1\n","        word_counts[word] = 1\n","    else:\n","        # В противном случае, увеличиваем количество слов на 1\n","        word_counts[word] += 1\n","\n","# Выводим количество глав\n","print('Количество глав: {}'.format(count_chapter))\n","\n","# Создаем цикл по ключам и их порядковым номерам полученного словаря\n","for i, key in enumerate(word_counts):\n","    # Выводим только первые 10 слов\n","    if i == 10:\n","        break\n","    print(key, word_counts[key])"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["# Инициализируем общий список, в котором будем хранить списки слов в каждой главе\n","chapter_data = []\n","# Инициализируем список слов, в котором будет хранить слова одной главы\n","chapter_words = []\n","\n","# Создаем цикл по всем словам из списка\n","for word in data:\n","    # Проверяем, что текущее слово - обозначение новой главы\n","    if word == '[new chapter]':\n","        # Если условие выполняется, добавляем список со словами из главы в общий список\n","        chapter_data.append(chapter_words)\n","        # Обновляем (перезаписываем) список со словами из текущей главы\n","        chapter_words = []\n","    else:\n","        # В противном случае, добавляем текущее слово в список со словами из главы\n","        chapter_words.append(word)\n","\n","# Проверяем, что у нас получилось столько же списков, сколько глав в произведении\n","print('Вложенный список содержит {} внутренних списка'.format(len(chapter_data)))\n","# Выведем первые 100 слов 0-ой главы\n","print(chapter_data[0][:100])\n","print(chapter_data[15][100])"]},{"cell_type":"markdown","metadata":{},"source":["Сколько раз каждое слово встречается в каждой из глав:"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":[]},{"cell_type":"markdown","metadata":{},"source":["# Задание 1.\n","Напишите программу, которая позволит получать частоту употребления любого заданного слова target_word в заданной главе target_chapter."]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["# Инициализируем список, в котором будем хранить словари\n","chapter_words_count = []\n","\n","# Создаем цикл по элементам внешнего списка со словами\n","for chapter_words in chapter_data:\n","    # Инициализируем пустой словарь, куда будем добавлять результаты\n","    temp = {}\n","    # Создаем цикл по элементам внутреннего списка\n","    for word in chapter_words:\n","        # Проверяем, что текущего слова еще нет в словаре\n","        if word not in temp:\n","            # Если условие выполняется, добавляем ключ в словарь\n","            temp[word] = 1\n","        else:\n","            # В противном случае, увеличиваем количество влождений слова в главу\n","            temp[word] += 1\n","    # Добавляем получившийся словарь в список\n","    chapter_words_count.append(temp)\n","\n","# Выводим результат\n","print(chapter_words_count)\n","print(chapter_words_count[15]['князю'])"]},{"cell_type":"markdown","metadata":{},"source":["- word_set - множество из всех слов, которые есть в книге\n","- count_chapter - количество глав в книге (171)\n","- word_counts - словарь, ключами которого являются слова, а значениями - количество вхождений этих слов в книгу\n","- chapter_data - список из 171 списка, где элементы вложенных списков - все слова из главы. Каждый список соответствует своей главе\n","- chapter_words_count - список из 171 словаря, где ключи - слова, а значения - количество слов в главе. Каждый словарь соответствует своей главе"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["# Создаем цикл по ключам словаря - спискам слов и их порядковым номерам\n","for chapter_number, chapter_dict in enumerate(chapter_words_count):\n","    # Выводим только первые 5 глав\n","    if chapter_number == 5:\n","        break\n","    # Выводим номер главы\n","    print('-' * 40)\n","    print('Chapter: {}'.format(chapter_number))\n","    print('-' * 40)\n","    # Создаем цикл по ключам - словам и их порядковым номерам\n","    for j, word in enumerate(chapter_dict):\n","        # Выводим первые 10 слов из главы\n","        if j == 10:\n","            break\n","        print(word, chapter_dict[word])"]},{"cell_type":"markdown","metadata":{},"source":["# Задание 2.\n","Напишите программу, которая позволит вычислять document frequency для заданного слова target_word и выведить результат на экран."]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":[]},{"cell_type":"markdown","metadata":{},"source":["# Задание 3.\n","Напишите программу, которая позволяет вычислять значение tf-idf для заданного слова target_word в заданной главе target_chapter."]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":[]},{"cell_type":"markdown","metadata":{},"source":["# Задание 4.\n","Напишите программу, которая позволяет вывести три слова, имеющие самое высокое значение tf-idf в заданной главе target_chapter в порядке убывания tf-idf."]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":[]}],"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"name":"python","version":"3.12.0 (tags/v3.12.0:0fb18b0, Oct  2 2023, 13:03:39) [MSC v.1935 64 bit (AMD64)]"},"orig_nbformat":4,"vscode":{"interpreter":{"hash":"3d3db4e9decadc7cbbe01f1ffad07b5cbe325c0d8371fd9fa2a1c27565f56da0"}}},"nbformat":4,"nbformat_minor":2}
